Tekla Open API Reference for Tekla Structures 2025
GeometryConstants Constructor
Initializes a new instance of the GeometryConstants class
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GeometryConstants()
Public Sub New
See Also
Reference
GeometryConstants Class
Tekla.Structures.Geometry3d Namespace